_posts/2015-02-19-datetime vs. numpy vs. pandas.html
---
layout: default
title: Datetime conversion discovery
excerpt: How different underlying types make for confusing conversions between datetime formats in python
---


<p>
Date and time handling seem to always be a tiny bit frustrating. This is not
only because getting it right is a really hard thing to do but also because
there are many different ways of looking at the problem. In python, there are
lots of differen types and modules for handling dates and times, including the
builtin <code>datetime</code> module, <code>numpy</code>'s <code>datetime64</code> system and the many different
tools and abstractions that <code>pandas</code> provides on top.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np
<span style="color: #F0DFAF; font-weight: bold;">import</span> pandas <span style="color: #F0DFAF; font-weight: bold;">as</span> pd
<span style="color: #F0DFAF; font-weight: bold;">import</span> datetime
</pre>
</div>

<p>
This <code>datetime.datetime</code> objects is initialized based on seconds.
For example, this will work:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dt64</span> = np.datetime64<span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">'2015-02-19T15:20:15'</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">datetime_cast</span> = dt64.astype<span style="color: #DCDCCC;">(</span>datetime.datetime<span style="color: #DCDCCC;">)</span>
datetime_cast
</pre>
</div>

<pre class="example">
datetime.datetime(2015, 2, 19, 14, 20, 15)
</pre>

<p>
However, if you start using types and time bases other than second and minutes,
the conversions will just not work, and return <code>long</code> objects.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dt64</span> = np.datetime64<span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">'2015-02-19T15:20:15'</span>,<span style="color: #CC9393;">'ns'</span><span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">nanoseconds</span>
<span style="color: #DFAF8F;">datetime_cast</span> = dt64.astype<span style="color: #DCDCCC;">(</span>datetime.datetime<span style="color: #DCDCCC;">)</span>
datetime_cast
</pre>
</div>

<pre class="example">
1424355615000000000L
</pre>

<p>
I stumbled across this when working with <code>pandas</code> timeseries.
<code>pd.Datetimeindex</code> objects use <code>datetime64[ns]</code> objects under the hood to that
if for some reason you were to create a timerange using pandas and work with
the underlying <code>datetime64[ns]</code> array. A conversion to <code>datetime.datetime</code>
objects will no longer work directly.
</p>

<p>
Let's say we have this construct:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dates</span> = pd.date_range<span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">'2012-1-1'</span>, periods=5, freq=<span style="color: #CC9393;">'D'</span><span style="color: #DCDCCC;">)</span>
dates
</pre>
</div>

<pre class="example">
&lt;class 'pandas.tseries.index.DatetimeIndex'&gt;
[2012-01-01, ..., 2012-01-05]
Length: 5, Freq: D, Timezone: None
</pre>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dates_dt64</span> = dates.values
dates_dt64
</pre>
</div>

<pre class="example">
array(['2012-01-01T01:00:00.000000000+0100',
       '2012-01-02T01:00:00.000000000+0100',
       '2012-01-03T01:00:00.000000000+0100',
       '2012-01-04T01:00:00.000000000+0100',
       '2012-01-05T01:00:00.000000000+0100'], dtype='datetime64[ns]')
</pre>

<p>
and we want see represent a value as a <code>datetime.datetime</code> object.
As long as we stay within pandas, we're fine:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">ts</span> = dates<span style="color: #DCDCCC;">[</span>0<span style="color: #DCDCCC;">]</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">scalar timestamp</span>
ts
</pre>
</div>
<pre class="example">
Timestamp('2012-01-01 00:00:00', offset='D')
</pre>

<div class="org-src-container">

<pre class="src src-python">ts.to_datetime<span style="color: #DCDCCC;">()</span>
</pre>
</div>
<pre class="example">
datetime.datetime(2012, 1, 1, 0, 0)
</pre>

<p>
If we use the underlying values however:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dt64</span> = dates_dt64<span style="color: #DCDCCC;">[</span>0<span style="color: #DCDCCC;">]</span>  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">scalar datetime64 object</span>
<span style="color: #DFAF8F;">dt</span> = dt64.astype<span style="color: #DCDCCC;">(</span>datetime.datetime<span style="color: #DCDCCC;">)</span>  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">try cast</span>
dt
</pre>
</div>

<pre class="example">
1325376000000000000L
</pre>

<p>
We get stuck with a <code>long</code> because <code>dates_dt64</code> base is in nanoseconds.
</p>
<div class="org-src-container">

<pre class="src src-python">ts.dtype
</pre>
</div>

<pre class="example">
'org_babel_python_eoe'
</pre>

<p>
The fix is easy when you know this is going on:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #DFAF8F;">dates_dt64_s</span> = dates_dt64.astype<span style="color: #DCDCCC;">(</span><span style="color: #CC9393;">'datetime64[s]'</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">dt64_s</span> = dates_dt64_s<span style="color: #DCDCCC;">[</span>0<span style="color: #DCDCCC;">]</span>  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">single datetime63 object</span>
<span style="color: #DFAF8F;">dt_seconds</span> = dt64_s.astype<span style="color: #DCDCCC;">(</span>datetime.datetime<span style="color: #DCDCCC;">)</span>
dt_seconds
</pre>
</div>

<pre class="example">
datetime.datetime(2012, 1, 1, 0, 0)
</pre>

<p>
Thank god that for most use cases, pandas handles all of these weird casts and
conversions beautifully so that you don't need to know any of the above in 99%
of your uses.
</p>
